Revit 2027 API
ParameterTypeId.Directcontext3dApplicationId Property
 "ApplicationId"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Directcontext3dApplicationId { get; }
Public Shared ReadOnly Property Directcontext3dApplicationId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Directcontext3dApplicationId {
	ForgeTypeId^ get ();
}
static member Directcontext3dApplicationId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace